EWSEditor/EwsPostExamples/MarkAllItemsAsRead.xml

<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
               xmlns:m="http://schemas.microsoft.com/exchange/services/2006/messages"
               xmlns:t="http://schemas.microsoft.com/exchange/services/2006/types"
               xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Header>
    <t:RequestServerVersion Version="Exchange2013" />
  </soap:Header>
  <soap:Body>
    <m:MarkAllItemsAsRead>
      <m:ReadFlag>true</m:ReadFlag>
      <m:SuppressReadReceipts>true</m:SuppressReadReceipts>
      <m:FolderIds>
        <t:FolderId Id="AAMkADEzOTExYZRAAA="
                    ChangeKey="AQAAAAA3vA==" />
      </m:FolderIds>
    </m:MarkAllItemsAsRead>
  </soap:Body>
</soap:Envelope>